Autodesk.Navisworks.Api.FileResolutionEventArgs
Base class for file resolution related events

Autodesk.Navisworks.Api.FileResolutionEventArgs.FileReference
Get file reference to be resolved

Autodesk.Navisworks.Api.FileResolutionEventArgs.FileReferenceType
Get type of file reference to be resolved

Autodesk.Navisworks.Api.FileResolutionEventArgs.ReferringFileName
Get file name that is referring to file to be resolved, or null if not known

Autodesk.Navisworks.Api.FileResolutionEventArgs.ReferringFileNameAsSaved
Get file name that is referring to file to be resolved as it was when saved, or null if not known

Autodesk.Navisworks.Api.FileResolutionEventArgs.ResolveToOpen
Get whether file is being resolved in order to open it.